let list = [{
    title: '医疗美容',
    list: ['艺术生', '网红', '模特', '微整形', '职场新人类', '白领', '大学生', '家庭主妇', '男性', '90后']
}, {
    title: '教育培训',
    list: ['中小学家长', '职场新人', '本专科学历人才', '专业人士（医生律师等）', '同城客户', '公务员', '程序员', '高考生', '工薪阶层', '艺术生']
}, {
    title: '家居建材',
    list: ['新婚夫妇', '业主', '开发商', '房东', '炒房族', '租客', '二手房群体', '单身狗', '80后', '90后', '打工族', '陪读家长']
}, {
    title: '零售行业',
    list: ['小区居民', '家庭主妇', '宝妈奶爸', '小卖部老板', '中老年', '年轻人', '投资商', '猫奴狗奴', '学生群体', '企业老板']
}, {
    title: '金融保险',
    list: ['在职员工', '股民', '大学生', '老年人', '80后', '家长', '上班族', '有车一族', '已婚人士', '企业主']
}, {
    title: '汽车产业',
    list: ['司机', '家长', '职员', '老板', '已婚人士', '旅游达人', '车主', '二手车用户', '新车用户', '90后']
},];

let tranformList = list.map(n => {
    let tab = {
        title: n.title
    }
    tab.sub = n.list.map(m => {
        return {
            title: m
        }
    })
    return tab;
})
export default tranformList;
